<template>
  <div class="newsinfo">
    <Navbar :title="title" />
    <h3 class="title">《雪中机场！！！》</h3>
    <p class="subtitle">
      <span>发表时间：</span>
      <span>点击次数：0次</span>
    </p>
    <hr />
    <div class="content"></div>在机场呆了一夜，已经是凌晨6点半了。雾还没有散，透过候机大厅的玻璃窗只看到眼前被分割出一格一格的茫然。停机坪里浮动着，一些模模糊糊的黑影，或许是车辆，或许是谁的的背影。机场的雪，玻璃上的雾，都变成一颗颗受伤的心侵蚀着我的灵魂。 7点50的登机时间，因为 下雪的原因被阻断了，眼前的真实世界，陌生的城市，整个航站楼犹如一座没有生命的城堡，护城河干凅，长城倒塌，也表达不了我此刻受伤的心灵 。 看着旁边的大叔津津有味的吃着杯面，一天到晚没吃东西的我居然没有一点饿意，难道我真的失恋了吗？来的时候根本就没有想过，他会不来接我，在飞机上一次又一次的想象着见到他的场景，冲过去抱着他，纵使他有千错万错，也会原谅他，想着他看到我会是什么样的表情，在3个多小时飞行旅程中反复回忆和想象着。。然而他没有来接我，或许是愧对，或许是讨厌，或许是无所谓，总之他就是没有来，随着时间的过去，登机时间到了，是最早一趟飞机的原因，，位子都没有座满，索性一个人找了个靠窗子的位子，雾也太大了，才擦干分分钟又一层贴了上来，犹如这赶不走的忧伤。。没没想到人生第一次座飞机会是在这样的情况下，满满都是悲剧，记得他和我在一起的时候，什么都听我的，在一起八年小吵小闹是有过，可满满都是幸福，在昆明有个属于我们自己的小家，不舒服会煮皮蛋稀饭给我吃，早已认定他是这辈子的依靠，也没有想过他会有离我而去的那天，也没有想过没有他，我以后改怎么生活…………小姐请问是要咖啡还是要牛奶，漂亮的空姐打断了我的沉思，噢来杯咖啡吧！座在窗子边的我也无暇看窗外的风景，特别+_+特别讨厌这种没着没落的感觉。在有一个朵小时就到昆明了，在昆明的宁老师早已经来到长水机场，千叮万嘱咐在怎么伤心也不能在外面哭，一个小女孩家不安全，到了车上在想怎么哭就怎么哭，遇上她算我幸运，一直像家人一样的在照顾我。想着想着思绪又转到了他身上，我们曾经一起生活过，共同拥有回忆，从他没来接我的那一刻起，彼此的人生关联会被狠心切断，难道他就不伤心吗？有什么天大的事情要做，非要选择放开我的手不可？座上你们老师的车，透过窗子，长水机场离我越来越远，你现在在干什么？是在睡觉还是也在同样的担心我？？………未完待续………………
  </div>
</template>

<script>
export default {
  props: ["title"],
  data() {
    return {
      id: this.$route.query.id,
      newsinfo: {}
    };
  },
  created() {
    //按照对应的id获取到数据后，直接在结构想染就行，因为是对象数组里要第一个。不需要v-for循环
    this.$axios
      .get("newsinfo/${id}")
      .then(data => {
        this.newsinfo = data.data[0];
      })
      .catch(error => {
        console.log("获取新闻详情失败！", error);
      });
  },
  components: {}
};
</script>

<style lang="less" >
.newsinfo {
  padding: 0 4px;
  .title {
    font-size: 16px;
    text-align: center;
    color: red;
    margin: 15px 0;
  }
  .subtitle {
    font-size: 13px;
    display: flex;
    justify-content: space-between;
    color: dodgerblue;
  }
  .content {
    img {
      width: 100%;
      height: 100%;
    }
  }
}
</style>